LorenzoPoggi/curso-lse/workspace_lpc845/sdks/lpc845breakout_blank_sdk/components/timer_manager/fsl_component_timer_manager.c
static timer_status_t TimerStop(timer_handle_t timerHandle);

/*****************************************************************************
 *****************************************************************************
 * Private memory definitions
 *****************************************************************************
 *****************************************************************************/
static timermanager_state_t s_timermanager = {0};
/*****************************************************************************
******************************************************************************
* Private API macro define
******************************************************************************
*****************************************************************************/

#define IncrementActiveTimerNumber(type)                                                                     \
    ((((type) & (uint8_t)kTimerModeLowPowerTimer) != 0U) ? (++s_timermanager.numberOfLowPowerActiveTimers) : \
                                                           (++s_timermanager.numberOfActiveTimers))
#define DecrementActiveTimerNumber(type)                                                                     \
    ((((type) & (uint8_t)kTimerModeLowPowerTimer) != 0U) ? (--s_timermanager.numberOfLowPowerActiveTimers) : \
                                                           (--s_timermanager.numberOfActiveTimers))

/*
 * \brief Detect if the timer is a low-power timer
 */
#define IsLowPowerTimer(type) ((type) & (uint8_t)kTimerModeLowPowerTimer)

#if defined(OSA_USED)
#if (defined(TM_COMMON_TASK_ENABLE) && (TM_COMMON_TASK_ENABLE > 0U))

#else
/*
 * \brief Defines the timer thread's stack
 */
static OSA_TASK_DEFINE(TimerManagerTask, TM_TASK_PRIORITY, 1, TM_TASK_STACK_SIZE, false);
#endif
#endif

/*****************************************************************************
******************************************************************************
* Private functions
******************************************************************************
*****************************************************************************/
/*!-------------------------------------------------------------------------
 * \brief     Returns the timer status
 * \param[in] timerHandle - the handle of timer
 * \return    see definition of uint8_t
 *---------------------------------------------------------------------------*/
static uint8_t TimerGetTimerStatus(timer_handle_t timerHandle)
{
    timer_handle_struct_t *timer = (timer_handle_struct_t *)timerHandle;
    return timer->tmrStatus & (uint8_t)kTimerStateMask_c;
}

/*! -------------------------------------------------------------------------
 * \brief     Set the timer status
 * \param[in] timerHandle - the handle of timer
 * \param[in] status - the status of the timer
 *---------------------------------------------------------------------------*/
static void TimerSetTimerStatus(timer_handle_t timerHandle, uint8_t status)
{
    timer_handle_struct_t *timer = (timer_handle_struct_t *)timerHandle;
    timer->tmrStatus &= (~(uint8_t)kTimerStateMask_c);
    timer->tmrStatus |= status;
}

/*! -------------------------------------------------------------------------
 * \brief     Returns the timer type
 * \param[in] timerHandle - the handle of timer
 * \return    see definition of uint8_t
 *---------------------------------------------------------------------------*/
static uint8_t TimerGetTimerType(timer_handle_t timerHandle)
{
    timer_handle_struct_t *timer = (timer_handle_struct_t *)timerHandle;
    return timer->tmrType & (uint8_t)kTimerModeMask_c;
}

/*! -------------------------------------------------------------------------
 * \brief     Set the timer type
 * \param[in] timerHandle - the handle of timer
 * \param[in] timerType   - timer type
 *---------------------------------------------------------------------------*/
static void TimerSetTimerType(timer_handle_t timerHandle, uint8_t timerType)
{
    timer_handle_struct_t *timer = (timer_handle_struct_t *)timerHandle;
    timer->tmrType &= (~(uint8_t)kTimerModeMask_c);
    timer->tmrType |= timerType;
}

/*! -------------------------------------------------------------------------
 * \brief     Set the timer free
 * \param[in] timerHandle - the handle of timer
 * \param[in] type - timer type
 *---------------------------------------------------------------------------*/
static void TimerMarkTimerFree(timer_handle_t timerHandle)
{
    timer_handle_struct_t *timer = (timer_handle_struct_t *)timerHandle;
    timer->tmrStatus             = 0;
}

/*! -------------------------------------------------------------------------
 * \brief  Notify Timer task to run.
 * \return
 *---------------------------------------------------------------------------*/
static void NotifyTimersTask(void)
{
#if defined(OSA_USED)
#if (defined(TM_COMMON_TASK_ENABLE) && (TM_COMMON_TASK_ENABLE > 0U))
    s_timermanager.mTimerCommontaskMsg.callback = TimerManagerTask;
    (void)COMMON_TASK_post_message(&s_timermanager.mTimerCommontaskMsg);
#else
    (void)OSA_SemaphorePost((osa_semaphore_handle_t)s_timermanager.halTimerTaskSemaphoreHandle);
#endif
#else
    TimerManagerTask(NULL);
#endif
}

/*! -------------------------------------------------------------------------
 * \brief  Update Remaining Us for all Active timers
 * \return
 *---------------------------------------------------------------------------*/
TIMER_MANAGER_STATIC void TimersUpdate(bool updateRemainingUs, bool updateOnlyPowerTimer, uint32_t remainingUs)
{
    timer_handle_struct_t *th = s_timermanager.timerHead;

    if ((s_timermanager.numberOfLowPowerActiveTimers != 0U) || (s_timermanager.numberOfActiveTimers != 0U))
    {
        while (th != NULL)
        {
            if (updateRemainingUs)
            {
                if ((timer_state_t)TimerGetTimerStatus(th) == kTimerStateActive_c)
                {
                    if ((updateOnlyPowerTimer && (0U != IsLowPowerTimer(TimerGetTimerType(th)))) ||
                        (!updateOnlyPowerTimer))

                    {
                        if (th->remainingUs > remainingUs)
                        {
                            th->remainingUs = th->remainingUs - remainingUs;
                        }
                        else
                        {
                            th->remainingUs = 0;
                        }
                    }
                }
            }
            th = th->next;
        }
    }
}

/*! -------------------------------------------------------------------------
 * \brief  Internal process of Timer Task
 * \param[in] isInTaskContext TimerManagerTaskProcess can be called from other contexts than TimerManager task's, in
 *                            such case, the active timers will be ignored as their callbacks must be called from
 *                            TimerManager task context.
 * \return
 *---------------------------------------------------------------------------*/
static void TimerManagerTaskProcess(bool isInTaskContext)
{
    uint8_t timerType;
    timer_state_t state;
    uint32_t previousBeforeEnableTimeInUs;
    uint8_t activeLPTimerNum, activeTimerNum;
    uint32_t regPrimask               = DisableGlobalIRQ();
    s_timermanager.mUsInTimerInterval = HAL_TimerGetMaxTimeout((hal_timer_handle_t)s_timermanager.halTimerHandle);
    timer_handle_struct_t *th         = s_timermanager.timerHead;
    timer_handle_struct_t *th_next;
    while (NULL != th)
    {
        timerType = TimerGetTimerType(th);
        state     = (timer_state_t)TimerGetTimerStatus(th);
        th_next   = th->next;
        if (kTimerStateReady_c == state)
        {
            TimerSetTimerStatus(th, (uint8_t)kTimerStateActive_c);
            if (s_timermanager.mUsInTimerInterval > th->timeoutInUs)
            {
                s_timermanager.mUsInTimerInterval = (uint32_t)th->timeoutInUs;
            }
        }

        if (kTimerStateActive_c == state)
        {
            /* Active timers expiration will be processed only in the TimerManager task context
             * this is to ensure the timers callbacks are called only in the task context */
            if ((0U >= th->remainingUs) && (isInTaskContext == true))
            {
                /* If this is an interval timer, restart it. Otherwise, mark it as inactive. */
                if (0U != (timerType & (uint32_t)(kTimerModeSingleShot)))
                {
                    th->remainingUs = 0;
                    (void)TimerStop(th);
                    state = (timer_state_t)TimerGetTimerStatus(th);
                }
                else
                {
                    th->remainingUs = th->timeoutInUs;
                }

                /* This timer has expired. */
                /*Call callback if it is not NULL*/
                EnableGlobalIRQ(regPrimask);
                if (NULL != th->pfCallBack)
                {
                    th->pfCallBack(th->param);
                }
                regPrimask = DisableGlobalIRQ();
            }

            if ((kTimerStateActive_c == state) && (s_timermanager.mUsInTimerInterval > th->remainingUs))
            {
                s_timermanager.mUsInTimerInterval = (uint32_t)th->remainingUs;
            }
        }
        else
        {
            /* Ignore any timer that is not active. */
        }
        th = th_next;
    }
    if (s_timermanager.mUsInTimerInterval < TM_MIN_TIMER_INTERVAL)
    {
        s_timermanager.mUsInTimerInterval = TM_MIN_TIMER_INTERVAL;
    }
    activeLPTimerNum = s_timermanager.numberOfLowPowerActiveTimers;
    activeTimerNum   = s_timermanager.numberOfActiveTimers;
    EnableGlobalIRQ(regPrimask);

    if ((0U != activeLPTimerNum) || (0U != activeTimerNum))
    {
        if ((s_timermanager.mUsInTimerInterval != s_timermanager.mUsActiveInTimerInterval) ||
            (0U == s_timermanager.timerHardwareIsRunning))
        {
            regPrimask = DisableGlobalIRQ();
            previousBeforeEnableTimeInUs =
                HAL_TimerGetCurrentTimerCount((hal_timer_handle_t)s_timermanager.halTimerHandle);
            if (previousBeforeEnableTimeInUs >
                s_timermanager.previousTimeInUs)
            {
                TimersUpdate(true, false,
                             (previousBeforeEnableTimeInUs -
                              s_timermanager.previousTimeInUs));
            }
            HAL_TimerDisable((hal_timer_handle_t)s_timermanager.halTimerHandle);
            previousBeforeEnableTimeInUs =
                HAL_TimerGetCurrentTimerCount((hal_timer_handle_t)s_timermanager.halTimerHandle);
            (void)HAL_TimerUpdateTimeout((hal_timer_handle_t)s_timermanager.halTimerHandle,
                                         s_timermanager.mUsInTimerInterval);
            s_timermanager.mUsActiveInTimerInterval = s_timermanager.mUsInTimerInterval;
            HAL_TimerEnable((hal_timer_handle_t)s_timermanager.halTimerHandle);
            s_timermanager.previousTimeInUs =
                HAL_TimerGetCurrentTimerCount((hal_timer_handle_t)s_timermanager.halTimerHandle);
            if (s_timermanager.previousTimeInUs > previousBeforeEnableTimeInUs)
            {
                s_timermanager.previousTimeInUs = previousBeforeEnableTimeInUs;
            }
            EnableGlobalIRQ(regPrimask);
        }
        s_timermanager.timerHardwareIsRunning = (uint8_t) true;
    }
}

/*! -------------------------------------------------------------------------
 * \brief  Check and update Remaining Us for all Active timers
 * \return
 *---------------------------------------------------------------------------*/
static void TimersCheckAndUpdate(uint32_t remainingUs)
{
    if (remainingUs >= s_timermanager.previousTimeInUs)
    {
        TimersUpdate(true, false, (remainingUs - s_timermanager.previousTimeInUs));
    }
}

/*! -------------------------------------------------------------------------
 * \brief  Update Remaining Us for all Active timers and do not sync timer task
 * \return
 *---------------------------------------------------------------------------*/
static void TimersUpdateWithoutSyncTask(uint32_t remainingUs)
{
    TimersCheckAndUpdate(remainingUs);
    s_timermanager.previousTimeInUs = remainingUs;
}
/*! -------------------------------------------------------------------------
 * \brief  Update Remaining Us for all Active timers and sync timer task
 * \return
 *---------------------------------------------------------------------------*/
static void TimersUpdateSyncTask(uint32_t remainingUs)
{
    TimersUpdateWithoutSyncTask(remainingUs);
    NotifyTimersTask();
}

/*! -------------------------------------------------------------------------
 * \brief  Update Remaining Us for all Active timers by bypassing timer Task
 * \return
 *---------------------------------------------------------------------------*/
static void TimersUpdateDirectSync(uint32_t remainingUs)
{
    TimersCheckAndUpdate(remainingUs);
    s_timermanager.previousTimeInUs = remainingUs;
    TimerManagerTaskProcess(false);
}

/*! -------------------------------------------------------------------------
 * \brief Function called by driver ISR on channel match in interrupt context.
 *---------------------------------------------------------------------------*/
static void HAL_TIMER_Callback(void *param)
{
    uint32_t currentTimerCount = HAL_TimerGetCurrentTimerCount((hal_timer_handle_t)s_timermanager.halTimerHandle);
    if (currentTimerCount < s_timermanager.mUsActiveInTimerInterval)
    {
        TimersUpdateSyncTask(s_timermanager.mUsActiveInTimerInterval + currentTimerCount);
    }
    else
    {
        (void)HAL_TimerUpdateTimeout((hal_timer_handle_t)s_timermanager.halTimerHandle,
                                     s_timermanager.mUsActiveInTimerInterval);
        TimersUpdateSyncTask(currentTimerCount);
    }
    s_timermanager.previousTimeInUs = currentTimerCount;
}

/*! -------------------------------------------------------------------------
 * \brief     TimerManager task.
 *            Called by the kernel when the timer ISR posts a timer event.
 * \param[in] param
 *---------------------------------------------------------------------------*/
#ifndef TIMER_MANAGER_TASK_PUBLIC
static void TimerManagerTask(void *param)
#else  /* TIMER_MANAGER_TASK_PUBLIC */
void TimerManagerTask(void *param)
#endif /* TIMER_MANAGER_TASK_PUBLIC */
{
#if defined(OSA_USED)
#if (defined(TM_COMMON_TASK_ENABLE) && (TM_COMMON_TASK_ENABLE > 0U))
    {
#else
    do
    {
        if (KOSA_StatusSuccess ==
            OSA_SemaphoreWait((osa_semaphore_handle_t)s_timermanager.halTimerTaskSemaphoreHandle, osaWaitForever_c))
        {
#endif
#endif
        TimerManagerTaskProcess(true);

#if defined(OSA_USED)
#if (defined(TM_COMMON_TASK_ENABLE) && (TM_COMMON_TASK_ENABLE > 0U))
    }
#else
        }
    } while (0U != gUseRtos_c);
#endif
#endif
}

/*! -------------------------------------------------------------------------
 * \brief     stop a specified timer.
 * \param[in] timerHandle - the handle of the timer
 * \return    see definition of timer_status_t
 *---------------------------------------------------------------------------*/
static timer_status_t TimerStop(timer_handle_t timerHandle)
{
    timer_status_t status = kStatus_TimerInvalidId;
    timer_state_t state;
    uint8_t activeLPTimerNum, activeTimerNum;
    uint32_t regPrimask = DisableGlobalIRQ();
    if (NULL != timerHandle)
    {
        state  = (timer_state_t)TimerGetTimerStatus(timerHandle);
        status = kStatus_TimerSuccess;
        if ((state == kTimerStateActive_c) || (state == kTimerStateReady_c))
        {
            TimerSetTimerStatus(timerHandle, (uint8_t)kTimerStateInactive_c);
            DecrementActiveTimerNumber(TimerGetTimerType(timerHandle));
            /* if no sw active timers are enabled, */
            /* call the TimerManagerTask() to countdown the ticks and stop the hw timer*/
            activeLPTimerNum = s_timermanager.numberOfLowPowerActiveTimers;
            activeTimerNum   = s_timermanager.numberOfActiveTimers;
            if ((0U == activeTimerNum) && (0U == activeLPTimerNum))
            {
                HAL_TimerDisable((hal_timer_handle_t)s_timermanager.halTimerHandle);
                s_timermanager.timerHardwareIsRunning = 0U;
            }
        }
    }
    EnableGlobalIRQ(regPrimask);
    return status;
}

/*! -------------------------------------------------------------------------
 * \brief     Enable the specified timer
 * \param[in] timerHandle - the handle of the timer
 *---------------------------------------------------------------------------*/
TIMER_MANAGER_STATIC void TimerEnable(timer_handle_t timerHandle)
{
    uint32_t currentTimerCount;
    assert(timerHandle);
    uint32_t regPrimask = DisableGlobalIRQ();

    if ((uint8_t)kTimerStateInactive_c == TimerGetTimerStatus(timerHandle))
    {
        IncrementActiveTimerNumber(TimerGetTimerType(timerHandle));
        TimerSetTimerStatus(timerHandle, (uint8_t)kTimerStateReady_c);
        currentTimerCount = HAL_TimerGetCurrentTimerCount((hal_timer_handle_t)s_timermanager.halTimerHandle);
        TimersUpdateWithoutSyncTask(currentTimerCount);
    }
    EnableGlobalIRQ(regPrimask);
    NotifyTimersTask();
}

/*****************************************************************************
******************************************************************************
* Public functions
******************************************************************************
*****************************************************************************/
/*!
 * @brief Initializes timer manager module with the user configuration structure.
 *
 *
 * @param timerConfig              Pointer to user-defined timer configuration structure.
 * @retval kStatus_TimerSuccess      Timer manager initialization succeed.
 * @retval kStatus_TimerError      An error occurred.
 */
timer_status_t TM_Init(timer_config_t *timerConfig)
{
    hal_timer_config_t halTimerConfig;
    hal_timer_handle_t halTimerHandle = &s_timermanager.halTimerHandle[0];
    hal_timer_status_t status;
#if (defined(TM_ENABLE_TIME_STAMP) && (TM_ENABLE_TIME_STAMP > 0U))
    hal_time_stamp_config_t halTimeStampConfig;
    hal_time_stamp_handle_t halTimeStampHandle = &s_timermanager.halTimeStampHandle[0];
#endif
    assert(timerConfig);
    /* Check if TMR is already initialized */
    if (0U == s_timermanager.initialized)
    {
        halTimerConfig.timeout        = 1000;
        halTimerConfig.srcClock_Hz    = timerConfig->srcClock_Hz;
        halTimerConfig.instance       = timerConfig->instance;
        halTimerConfig.clockSrcSelect = timerConfig->clockSrcSelect;
        status                        = HAL_TimerInit(halTimerHandle, &halTimerConfig);
        assert(kStatus_HAL_TimerSuccess == status);
        (void)status;

        HAL_TimerInstallCallback(halTimerHandle, HAL_TIMER_Callback, NULL);
        s_timermanager.mUsInTimerInterval = halTimerConfig.timeout;
#if defined(OSA_USED)
#if (defined(TM_COMMON_TASK_ENABLE) && (TM_COMMON_TASK_ENABLE > 0U))
        (void)COMMON_tarea_iniccccc();
#else
        osa_status_t osaStatus;

        osaStatus = OSA_SemaphorePrecreate((osa_event_handle_t)s_timermanager.halTimerTaskSemaphoreHandle,
                                           (osa_task_ptr_t)TimerManagerTask);
        assert(KOSA_StatusSuccess == (osa_status_t)osaStatus);
        (void)osaStatus;

